zdavatz/fp-sns-stbox1/Middlewares/ST/STM32_BLE_Manager/Inc/ble_manager.h
/**
  ******************************************************************************
  * @file    ble_manager.h
  * @author  System Research & Applications Team - Agrate/Catania Lab.
  * @version 2.1.0
  * @date    11-March-2025
  * @brief   BLE Manager services APIs
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef _BLE_MANAGER_H_
#define _BLE_MANAGER_H_

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include <stdlib.h>
#include <stdint.h>

#include "ble_manager_conf.h"

#if !defined(BLE_UNUSED)
#define BLE_UNUSED(X) (void)X      /* To avoid gcc/g++ warnings */
#endif /* BLE_UNUSED */

#ifndef BLE_MANAGER_NO_PARSON
#include "parson.h"
#endif /* BLE_MANAGER_NO_PARSON */

/* Bluetooth core supported */
#define BLUENRG_1_2     0x00
#define BLUENRG_MS      0x01
#define BLUENRG_LP      0x02
#define BLUE_WB         0x03
#define STM32WB07_06    0x04
#define STM32WB05N      0x05

#if (BLUE_CORE == BLUENRG_MS)
#include "hci.h"
#include "hci_tl.h"
#include "hci_le.h"
#include "hci_const.h"
#include "bluenrg_types.h"
#include "bluenrg_gatt_server.h"
#include "bluenrg_gap.h"
#include "bluenrg_gap_aci.h"
#include "bluenrg_gatt_aci.h"
#include "bluenrg_hal_aci.h"
#include "bluenrg_aci_const.h"
#include "bluenrg_utils.h"
#include "bluenrg_l2cap_aci.h"
#include "sm.h"
#elif (BLUE_CORE == BLUENRG_LP)
#include "bluenrg_lp_aci.h"
#include "bluenrg_lp_hci_le.h"
#include "bluenrg_lp_events.h"
#include "hci_const.h"
#include "hci_tl.h"
#include "hci.h"
#include "bluenrg_utils.h"
#elif (BLUE_CORE == BLUE_WB)
#include "ble.h"
#include "ble_hal_aci.h"
#include "ble_gatt_aci.h"
#include "ble_gap_aci.h"
#include "ble_hci_le.h"
#include "ble_l2cap_aci.h"
#elif (BLUE_CORE == STM32WB07_06)
#include "stm32wb07_06_aci.h"
#include "stm32wb07_06_hci_le.h"
#include "stm32wb07_06_events.h"
#include "hci_const.h"
#include "hci_tl.h"
#include "hci.h"
#include "stm32wb07_06_utils.h"
#elif (BLUE_CORE == STM32WB05N)
#include "stm32wb05n_aci.h"
#include "stm32wb05n_hci_le.h"
#include "stm32wb05n_events.h"
#include "hci_const.h"
#include "hci_tl.h"
#include "hci.h"
#include "stm32wb_utils.h"
#else /* BLUENRG_1_2 */
#include "hci.h"
#include "bluenrg1_hal_aci.h"
#include "bluenrg1_gatt_aci.h"
#include "bluenrg1_gap_aci.h"
#include "bluenrg1_hci_le.h"
#include "bluenrg1_l2cap_aci.h"
#include "bluenrg1_events.h"
#endif /* (BLUE_CORE == BLUENRG_MS) */

/* Exported Defines ----------------------------------------------------------*/

/* BLE Manager Version only numbers 0->9 */
#define BLE_MANAGER_VERSION_MAJOR '2'
#define BLE_MANAGER_VERSION_MINOR '0'
#define BLE_MANAGER_VERSION_PATCH '0'

/* Length of AdvData in octets. Bumped from 28 → 31 on BlueNRG-LP / STM32WB07_06
   so set_connectable_ble can fit a complete-local-name field up to 11 chars
   (1 length + 1 type + up to 10 name chars) alongside the 16-byte manufacturer-
   specific field, staying within the BLE legacy advertising 31-byte limit. */
#if ((BLUE_CORE != BLUENRG_LP) && (BLUE_CORE != STM32WB07_06) && (BLUE_CORE != STM32WB05N))
#define BLE_MANAGER_ADVERTISE_DATA_LENGHT 25
#else /* ((BLUE_CORE != BLUENRG_LP) && (BLUE_CORE != STM32WB07_06) && (BLUE_CORE != STM32WB05N)) */
#define BLE_MANAGER_ADVERTISE_DATA_LENGHT 31
#endif /* ((BLUE_CORE != BLUENRG_LP) && (BLUE_CORE != STM32WB07_06) && (BLUE_CORE != STM32WB05N)) */

/* SDK value for used platform */
#define BLE_MANAGER_STEVAL_WESU1_PLATFORM          0x01U
#define BLE_MANAGER_SENSOR_TILE_PLATFORM           0x02U
#define BLE_MANAGER_BLUE_COIN_PLATFORM             0x03U
#define BLE_MANAGER_STEVAL_IDB008VX_PLATFORM       0x04U
#define BLE_MANAGER_STEVAL_BCN002V1_PLATFORM       0x05U
#define BLE_MANAGER_SENSOR_TILE_BOX_PLATFORM       0x06U
#define BLE_MANAGER_DISCOVERY_IOT01A_PLATFORM      0x07U
#define BLE_MANAGER_STEVAL_STWINKT1_PLATFORM       0x08U
#define BLE_MANAGER_STEVAL_STWINKT1B_PLATFORM      0x09U
#define BLE_MANAGER_STEVAL_STWINBX1_PLATFORM       0x0EU
#define BLE_MANAGER_STEVAL_ASTRA1_PLATFORM         0x0CU
#define BLE_MANAGER_SENSOR_TILE_BOX_PRO_PLATFORM   0x0DU
#define BLE_MANAGER_STEVAL_PROTEUS1_PLATFORM       0x0FU
#define BLE_MANAGER_STSYS_SBU06_PLATFORM           0x10U
#define BLE_MANAGER_SENSOR_TILE_BOX_PRO_B_PLATFORM 0x11U
#define BLE_MANAGER_STEVAL_STWINBX1_B_PLATFORM     0x12U
#define BLE_MANAGER_SENSOR_TILE_BOX_PRO_C_PLATFORM 0x13U
#define BLE_MANAGER_NUCLEO_PLATFORM                0x80U
#define BLE_MANAGER_STM32U5A5ZJ_NUCLEO_PLATFORM    0x7AU
#define BLE_MANAGER_STM32U575ZI_NUCLEO_PLATFORM    0x7BU
#define BLE_MANAGER_STM32F446RE_NUCLEO_PLATFORM    0x7CU
#define BLE_MANAGER_STM32L053R8_NUCLEO_PLATFORM    0x7DU
#define BLE_MANAGER_STM32L476RG_NUCLEO_PLATFORM    0x7EU
#define BLE_MANAGER_STM32F401RE_NUCLEO_PLATFORM    0x7FU
#define BLE_MANAGER_WB05N_PLATFORM                 0x8FU
#define BLE_MANAGER_UNDEF_PLATFORM                 0xFFU

#define BLE_MANAGER_CUSTOM_COMMAND_VALUE_NAN 0xDEADBEEF

#define BLE_MANAGER_READ_CUSTOM_COMMAND "ReadCustomCommand"
#ifdef BLE_MANAGER_SDKV2
#if ((BLUE_CORE != BLUENRG_LP) && (BLUE_CORE != STM32WB07_06) && (BLUE_CORE != STM32WB05N))
#define BLE_MANAGER_CUSTOM_FIELD1 15
#define BLE_MANAGER_CUSTOM_FIELD2 16
#define BLE_MANAGER_CUSTOM_FIELD3 17
#define BLE_MANAGER_CUSTOM_FIELD4 18
#else /* ((BLUE_CORE != BLUENRG_LP) && (BLUE_CORE != STM32WB07_06) && (BLUE_CORE != STM32WB05N)) */
#define BLE_MANAGER_CUSTOM_FIELD1 18
#define BLE_MANAGER_CUSTOM_FIELD2 19
#define BLE_MANAGER_CUSTOM_FIELD3 20
#define BLE_MANAGER_CUSTOM_FIELD4 21
#endif /* ((BLUE_CORE != BLUENRG_LP) && (BLUE_CORE != STM32WB07_06) && (BLUE_CORE != STM32WB05N)) */
#endif /* BLE_MANAGER_SDKV2 */

#define COM_TYPE_ACC    1
#define COM_TYPE_MAG    2
#define COM_TYPE_GYRO   3
#define COM_TYPE_TEMP   4
#define COM_TYPE_PRESS  5
#define COM_TYPE_HUM    6
#define COM_TYPE_MIC    7
#define COM_TYPE_MLC    8

#define DATA_TYPE_UINT8     (uint8_t)(0x00)
#define DATA_TYPE_INT8      (uint8_t)(0x01)
#define DATA_TYPE_UINT16    (uint8_t)(0x02)
#define DATA_TYPE_INT16     (uint8_t)(0x03)
#define DATA_TYPE_UINT32    (uint8_t)(0x04)
#define DATA_TYPE_INT32     (uint8_t)(0x05)
#define DATA_TYPE_FLOAT     (uint8_t)(0x06)

#if (BLUE_CORE == BLUENRG_MS)
#define BLE_ERROR_UNSPECIFIED         ERR_UNSPECIFIED_ERROR
#define HCI_LE_SET_SCAN_RESPONSE_DATA hci_le_set_scan_resp_data
#define ACI_GATT_EXCHANGE_CONFIG      aci_gatt_exchange_configuration
#define ACI_GAP_PASS_KEY_RESP         aci_gap_pass_key_response
#endif /* (BLUE_CORE == BLUENRG_MS) */

#if (BLUE_CORE == BLUE_WB)
#define BLE_ERROR_UNSPECIFIED ERR_UNSPECIFIED_ERROR
#endif /* (BLUE_CORE == BLUE_WB) */

/* Exported Macros -----------------------------------------------------------*/
#ifndef MIN
#define MIN(a,b)            ((a) < (b) )? (a) : (b)
#endif /* MIN */

/* Exported Types ------------------------------------------------------------*/

typedef struct
{
  /* BLE stack setting */
  uint8_t config_value_offsets;
  uint8_t config_value_length;
  uint8_t gap_roles;
  uint8_t io_capabilities;
  uint8_t authentication_requirements;
  uint8_t mitm_protection_requirements;
#if (BLUE_CORE == BLUENRG_MS)
  uint8_t out_of_band_enable_data;
  uint8_t *oob_data;
#else /* (BLUE_CORE == BLUENRG_MS) */
  uint8_t secure_connection_support_option_code;
  uint8_t secure_connection_keypress_notification;
#endif /* (BLUE_CORE == BLUENRG_MS) */

