zdavatz/fp-sns-stbox1/Middlewares/ST/STM32_BLE_Manager/Inc/ble_manager.h
  /* To set the TX power level of the bluetooth device */
  /* ----------------------
     | 0x00: Normal Power |
     | 0x01: High Power   |
     ---------------------- */
  uint8_t enable_high_power_mode;

  /* Values: 0x00 ... 0x31 - The value depends on the device */
  uint8_t power_amplifier_output_level;

  /* BLE Manager services setting */
  uint8_t enable_config;
  uint8_t enable_console;
#ifndef BLE_MANAGER_NO_PARSON
  uint8_t enable_ext_config;
#endif /* BLE_MANAGER_NO_PARSON */

  /* BLE Board Name. Widened from 8 → 16 (15-char + NUL) so BLE_FW_PACKAGENAME
     like "PumpTsueri" (10 chars) fits. Apps with shorter names still work —
     set_connectable_ble() advertises only strlen(board_name)+1 bytes, no
     trailing-zero pad. */
  char board_name[16];

  /* For enabling the Secure BLE connection */
  uint8_t enable_secure_connection;

  /* Secure Connection PIN */
  uint32_t secure_pin;

  /* For creating a Random Connection PIN */
  uint8_t enable_random_secure_pin;
#if ((BLUE_CORE != BLUENRG_LP) && (BLUE_CORE != STM32WB07_06) && (BLUE_CORE != STM32WB05N))
  uint8_t advertising_filter;
#endif /* ((BLUE_CORE != BLUENRG_LP) && (BLUE_CORE != STM32WB07_06) && (BLUE_CORE != STM32WB05N)) */

  /* Set to 1 for forcing a full BLE rescan for the Android/iOS "ST BLE Sensor" application */
  /* with the Secure connection it should not necessary because it will be managed directly by BLE Chip */
  uint8_t force_rescan;

  /* Set to PUBLIC_ADDR or RANDOM_ADDR */
  uint8_t own_address_type;

  /* Bluetooth Board Mac Address */
  uint8_t ble_mac_address[6];

  /* Advertising parameters */
  uint16_t adv_interval_min;
  uint16_t adv_interval_max;

  uint8_t board_id;

} ble_stack_object_t;

typedef struct
{
  /* Enable/Disable Board Report Extended configuration commands */
  uint8_t stm32_uid;
  uint8_t info;
  uint8_t help;
  uint8_t version_fw;
  uint8_t power_status;

  /* Enable/Disable Board Security Extended configuration commands */
  uint8_t change_secure_pin;
  uint8_t clear_secure_data;
  uint8_t read_certificate;
  uint8_t set_certificate;

  /* Enable/Disable Board Control Extended configuration commands */
  uint8_t reboot_on_dfu_mode_command;
  uint8_t power_off;
  uint8_t read_banks;
  uint8_t banks_swap;

  /* Enable/Disable Board Settings Extended configuration commands */
  uint8_t set_name;
  uint8_t read_custom_command;
  uint8_t set_date;
  uint8_t set_time;
  uint8_t set_wifi;
} ble_extended_configuration_object_t;

typedef struct
{
  /* BLE Char Definition */
  uint8_t uuid[16];
  uint8_t char_uuid_type;
#if (BLUE_CORE == BLUENRG_MS)
  uint8_t char_value_length;
#else /* (BLUE_CORE == BLUENRG_MS) */
  uint16_t char_value_length;
#endif /* (BLUE_CORE == BLUENRG_MS) */
  uint8_t char_properties;
  uint8_t security_permissions;
  uint8_t gatt_evt_mask;
  uint8_t enc_key_size;
  uint8_t is_variable;

  /* BLE Attribute handle */
  uint16_t attr_handle;
  /*LE Service handle  */
  uint16_t service_handle;

  /*  Callback function pointers */
  /*  Attribute Modify */
  void (*attr_mod_request_cb)(void *ble_char_pointer,
                              uint16_t attr_handle,
                              uint16_t offset,
                              uint8_t data_length,
                              uint8_t *att_data);
  /* Read Request */
#if ((BLUE_CORE != BLUENRG_LP) && (BLUE_CORE != STM32WB07_06) && (BLUE_CORE != STM32WB05N))
  void (*read_request_cb)(void *ble_char_pointer, uint16_t handle);
#else /* ((BLUE_CORE != BLUENRG_LP) && (BLUE_CORE != STM32WB07_06) && (BLUE_CORE != STM32WB05N)) */
  void (*read_request_cb)(void *ble_char_pointer,
                          uint16_t handle,
                          uint16_t connection_handle,
                          uint8_t operation_type,
                          uint16_t attr_val_offset,
                          uint8_t data_length,
                          uint8_t data[]);
#endif /* ((BLUE_CORE != BLUENRG_LP) && (BLUE_CORE != STM32WB07_06) && (BLUE_CORE != STM32WB05N)) */
  /* Write Request */
  void (*write_request_cb)(void *ble_char_pointer,
                           uint16_t attr_handle,
                           uint16_t offset,
                           uint8_t data_length,
                           uint8_t *att_data);
} ble_char_object_t;

/* Enum type for Service Notification Change */
typedef enum
{
  BLE_NOTIFY_NOTHING = 0, /* No Event */
  BLE_NOTIFY_SUB     = 1, /* Subscription Event */
  BLE_NOTIFY_UNSUB   = 2  /* Unsubscription Event */
} ble_notify_event_t;

/* Enum type for Standard Service Enabled or Not */
typedef enum
{
  BLE_SERV_NOT_ENABLE = 0, /* Service Not Enable */
  BLE_SERV_ENABLE    = 1  /* Service Enabled */
} ble_serv_enab_t;

/* Typedef for Wi-Fi credential */
typedef struct
{
  uint8_t *ssid;
  uint8_t *pass_wd;
  uint8_t *security;
} ble_wifi_cred_acc_t;

/* Typedef for Custom Command types */
typedef enum
{
  BLE_CUSTOM_COMMAND_VOID,
  BLE_CUSTOM_COMMAND_INTEGER,
  BLE_CUSTOM_COMMAND_BOOLEAN,
  BLE_CUSTOM_COMMAND_STRING,
  BLE_CUSTOM_COMMAND_ENUM_INTEGER,
  BLE_CUSTOM_COMMAND_ENUM_STRING
} ble_custom_command_types_t;

/* Structure for saving the Custom Commands */
typedef struct
{
  char *command_name;
  ble_custom_command_types_t command_type;
  void *next_command;
} ble_ext_custom_command_t;

/* Typedef for Custom Command */
typedef struct
{
  uint8_t *command_name;
  ble_custom_command_types_t command_type;
  int32_t int_value;
  uint8_t *string_value;
} ble_custom_commad_result_t;

typedef enum
{
  BLE_COMM_TP_START_PACKET = 0x00,
  BLE_COMM_TP_START_END_PACKET = 0x20,
  BLE_COMM_TP_MIDDLE_PACKET = 0x40,
  BLE_COMM_TP_END_PACKET = 0x80,
  BLE_COMM_TP_START_LONG_PACKET = 0x10
} ble_comm_tp_packet_t;

typedef enum
{
  BLE_COMM_TP_WAIT_START = 0,
  BLE_COMM_TP_WAIT_END = 1
} ble_comm_tp_status_t;

/* Exported Variables ------------------------------------------------------- */

extern  ble_serv_enab_t ble_conf_service;
extern  ble_serv_enab_t ble_std_term_service;
extern  ble_serv_enab_t ble_std_err_service;
extern  ble_serv_enab_t ble_ext_conf_service;

extern uint8_t buffer_to_write[256];
extern uint8_t bytes_to_write;
extern uint16_t custom_command_page_level;
extern uint8_t set_connectable;

