zdavatz/fp-sns-stbox1/Middlewares/ST/STM32_BLE_Manager/Inc/ble_manager.h
extern ble_stack_object_t ble_stack_value;
extern ble_extended_configuration_object_t ble_extended_configuration_value;

/* Manufacter Advertise data */
extern uint8_t manuf_data[BLE_MANAGER_ADVERTISE_DATA_LENGHT];

extern uint8_t max_ble_char_std_out_len;
extern uint8_t max_ble_char_std_err_len;

extern ble_ext_custom_command_t *ext_config_custom_commands;
extern ble_ext_custom_command_t *ext_config_last_custom_command;

/* Exported Function prototypes --------------------------------------------- */
#if ((BLUE_CORE == BLUENRG_LP) && (BLUE_CORE == STM32WB07_06))
extern void init_ble_int_for_blue_nrglp(void);
#endif /* (BLUE_CORE == BLUENRG_LP) && (BLUE_CORE == STM32WB07_06)) */
#if (BLUE_CORE == STM32WB05N)
extern void init_ble_int_for_stm32wb05n(void);
#endif /* (BLUE_CORE == STM32WB05N) */
/* Exported functions ------------------------------------------------------- */
#if (BLUE_CORE == BLUE_WB)
extern void hci_le_connection_complete_event(uint8_t status,
                                             uint16_t connection_handle,
                                             uint8_t role,
                                             uint8_t peer_address_type,
                                             uint8_t peer_address[6],
                                             uint16_t conn_interval,
                                             uint16_t conn_latency,
                                             uint16_t supervision_timeout,
                                             uint8_t master_clock_accuracy);

extern void aci_gatt_attribute_modified_event(uint16_t connection_handle,
                                              uint16_t attr_handle,
                                              uint16_t offset,
                                              uint16_t attr_data_length,
                                              uint8_t attr_data[]);

extern void aci_gatt_indication_event(uint16_t connection_handle,
                                      uint16_t attribute_handle,
                                      uint8_t attribute_value_length,
                                      uint8_t attribute_value[]);

#endif /* (BLUE_CORE == BLUE_WB) */

extern ble_status_t std_err_update(uint8_t *data, uint8_t length);
extern ble_status_t term_update(uint8_t *data, uint8_t length);
extern ble_status_t config_update(uint32_t feature, uint8_t command, uint8_t data);
extern ble_status_t config_update_32(uint32_t feature, uint8_t command, uint32_t data);
extern void       set_connectable_ble(void);
extern void update_adv_data(void);
extern void       set_not_connectable_ble(void);

extern ble_status_t init_ble_manager(void);
extern int32_t ble_manager_add_char(ble_char_object_t *ble_char);

extern ble_status_t aci_gatt_update_char_value_wrapper(ble_char_object_t *ble_char_pointer,
                                                       uint8_t char_val_offset,
                                                       uint8_t char_value_len,
                                                       uint8_t *char_value);
extern ble_status_t safe_aci_gatt_update_char_value(ble_char_object_t *ble_char_pointer,
                                                    uint8_t char_val_offset,
                                                    uint8_t char_value_len,
                                                    uint8_t *char_value);

#ifndef BLE_MANAGER_NO_PARSON
/* Add a Custom Command to a Generic Feature */
extern uint8_t generic_add_custom_command(ble_ext_custom_command_t **custom_commands,
                                          ble_ext_custom_command_t **last_custom_command,
                                          char *command_name,
                                          ble_custom_command_types_t command_type,
                                          int32_t default_value,
                                          int32_t min,
                                          int32_t max,
                                          int32_t *valid_values_int,
                                          char **valid_values_string,
                                          char *short_desc,
                                          JSON_Array *json_sensor_array);
/* Little specialization for Ext configuration */
#define ADD_CUSTOM_COMMAND(...) generic_add_custom_command(&ext_config_custom_commands,\
                                                           &ext_config_last_custom_command,\
                                                           __VA_ARGS__)

/* Clear the Custom Commands List for a Generic Feature */
extern void generic_clear_custom_commands_list(ble_ext_custom_command_t **custom_commands,
                                               ble_ext_custom_command_t **last_custom_command);
/* Little specialization for Ext configuration */
#define CLEAR_CUSTOM_COMMANDS_LIST() generic_clear_custom_commands_list(&ext_config_custom_commands,\
                                                                        &ext_config_last_custom_command)

extern void send_new_custom_command_list(void);
extern void send_error(char *message);
extern void send_info(char *message);
#endif /* BLE_MANAGER_NO_PARSON */

extern uint8_t get_blue_nrg_version(uint8_t *hw_version, uint16_t *fw_version);

/**
  * @brief
  * @param  uint8_t* buffer
  * @param  uint8_t len
  * @retval ble_status_t   Status
  */
extern ble_status_t ble_std_out_send_buffer(uint8_t *buffer, uint8_t len);

#ifndef BLE_MANAGER_NO_PARSON
/**
  * @brief  This function is called to parse a BLE_COMM_TP packet.
  * @param  buffer_out: pointer to the output buffer.
  * @param  buffer_in: pointer to the input data.
  * @param  len: buffer in length
  * @retval Buffer out length.
  */
extern uint32_t ble_command_tp_parse(uint8_t **buffer_out, uint8_t *buffer_in, uint32_t len);

/**
  * @brief  This function is called to prepare a BLE_COMM_TP packet.
  * @param  buffer_out: pointer to the buffer used to save BLE_COMM_TP packet.
  * @param  buffer_in: pointer to the input data.
  * @param  len: buffer in length
  * @param  byte_packet_size: Packet Size in Bytes
  * @retval Buffer out length.
  */
extern uint32_t ble_command_tp_encapsulate(uint8_t *buffer_out, uint8_t *buffer_in, uint32_t len,
                                           uint32_t byte_packet_size);

