zdavatz/fp-sns-stbox1/Middlewares/ST/STM32_BLE_Manager/Inc/ble_manager.h
extern ble_status_t ble_ext_configuration_update(uint8_t *data, uint32_t length);

extern ble_custom_commad_result_t *parse_custom_command(ble_ext_custom_command_t *loc_custom_commands,
                                                        uint8_t *hs_command_buffer);
extern ble_custom_commad_result_t *ask_generic_custom_commands(uint8_t *hs_command_buffer);
#endif /* BLE_MANAGER_NO_PARSON */

#ifdef ACC_BLUENRG_CONGESTION
#define ACI_GATT_UPDATE_CHAR_VALUE safe_aci_gatt_update_char_value
#else /* ACC_BLUENRG_CONGESTION */
#define ACI_GATT_UPDATE_CHAR_VALUE aci_gatt_update_char_value_wrapper
#endif /* ACC_BLUENRG_CONGESTION */

/*************************** Bluetooth Communication **************************/
#if (BLUE_CORE == BLUENRG_MS)
extern void connection_completed_function(uint16_t connection_handle, uint8_t addr[6]);
#elif (BLUE_CORE == BLUE_WB)
extern void connection_completed_function(uint16_t connection_handle);
#else /* (BLUE_CORE == BLUENRG_MS) */
extern void connection_completed_function(uint16_t connection_handle, uint8_t address_type, uint8_t addr[6]);
#endif /* (BLUE_CORE == BLUENRG_MS) */

extern void disconnection_completed_function(void);
extern void pairing_completed_function(uint8_t pairing_status);
extern void set_connectable_function(uint8_t *manuf_data);
extern void mtu_exchange_resp_event_function(uint16_t server_rx_mtu);
extern void aci_gatt_tx_pool_available_event_function(void);
extern void hardware_error_event_handler_function(uint8_t hardware_code);

/******************************** Debug Console *******************************/
extern uint32_t debug_console_parsing(uint8_t *att_data, uint8_t data_length);

/********************************* Config Char ********************************/
extern void attr_mod_config_function(uint8_t *att_data, uint8_t data_length);
extern void write_request_config_function(uint8_t *att_data, uint8_t data_length);

#ifndef BLE_MANAGER_NO_PARSON
/***********************************************************************************************
  * Callback functions prototypes to manage the extended configuration characteristic commands *
  **********************************************************************************************/
extern void ext_ext_config_uid_command_callback(uint8_t **uid);
extern void ext_config_version_fw_command_callback(uint8_t *answer);
extern void ext_config_info_command_callback(uint8_t *answer);
extern void ext_config_help_command_callback(uint8_t *answer);
extern void ext_config_power_status_command_callback(uint8_t *answer);

extern void ext_config_change_pin_command_callback(uint32_t new_pin);
extern void ext_config_clear_db_command_callback(void);
extern void ext_config_read_cert_command_callback(uint8_t *certificate);
extern void ext_config_set_cert_command_callback(uint8_t *certificate);

extern void ext_config_reboot_on_dfu_mode_command_callback(void);
extern void ext_config_power_off_command_callback(void);
extern void ext_config_read_banks_fw_id_command_callback(uint8_t *cur_bank, uint16_t *fw_id1, uint16_t *fw_id2);
extern void ext_config_banks_swap_command_callback(void);

extern void ext_config_set_name_command_callback(uint8_t *new_name);
extern void ext_config_read_custom_commands_callback(JSON_Array *json_command_array);
extern void ext_config_custom_command_callback(ble_custom_commad_result_t *custom_command);
extern void ext_config_set_date_command_callback(uint8_t *new_date);
extern void ext_config_set_time_command_callback(uint8_t *new_time);
extern void ext_config_set_wi_fi_command_callback(ble_wifi_cred_acc_t new_wifi_cred);
#endif /* BLE_MANAGER_NO_PARSON */

#ifdef __cplusplus
}
#endif

#include "ble_implementation.h"

#endif /* _BLE_MANAGER_H_ */

